module.exports = Object.freeze({
    selectorList: ['title', 'genre'],
    currentSorting: 'year',
    sortingTypes: [{
        label: 'release date',
        prop: 'year'
    },
    {
        label: 'rating',
        prop: 'rating'
    }],
    moviesList: [
        {
            id: 0,
            title: 'Green Book 1',
            genre: 'Comedy',
            description: 'Утонченный светский лев, богатый и талантливый музыкант нанимает в качестве водителя и телохранителя человека, который менее всего подходит для этой работы. Тони по прозвищу Болтун — вышибала, не умеющий держать рот на замке и пользоваться столовыми приборами, зато он хорошо работает кулаками. Это турне навсегда изменит жизнь обоих.',
            imageURL: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1108577.jpg',
            year: '2018',
            rating: '8.3',
            duration: '120'
        },
        {
            id: 1,
            title: 'Green Book 2',
            genre: 'Comedy',
            description: 'Утонченный светский лев, богатый и талантливый музыкант нанимает в качестве водителя и телохранителя человека, который менее всего подходит для этой работы. Тони по прозвищу Болтун — вышибала, не умеющий держать рот на замке и пользоваться столовыми приборами, зато он хорошо работает кулаками. Это турне навсегда изменит жизнь обоих.',
            imageURL: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1108577.jpg',
            year: '2018',
            rating: '8.3',
            duration: '120'
        },
        {
            id: 2,
            title: 'Green Book 3',
            genre: 'Comedy',
            description: 'Утонченный светский лев, богатый и талантливый музыкант нанимает в качестве водителя и телохранителя человека, который менее всего подходит для этой работы. Тони по прозвищу Болтун — вышибала, не умеющий держать рот на замке и пользоваться столовыми приборами, зато он хорошо работает кулаками. Это турне навсегда изменит жизнь обоих.',
            imageURL: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1108577.jpg',
            year: '2018',
            rating: '8.3',
            duration: '120'
        }
    ]
});